<template>
	<div class="agreement">
		<van-nav-bar title="用户协议" left-text="返回" left-arrow @click-left="onClickLeft"/>	
		<div class="box">
			本神农牧用户注册协议（“本协议”）是您（“用户”）与
神农牧（在协议中，指浙江农辛农业科技有限公司及其
关联方）之间就神农牧服务（如下文定义）相关事宜一
致同意而订立的契约。<br />
请您审慎阅读并充分理解本协议，特别是其中与风险和
免责、送达、争议解决相关的条款，以及以粗体字标识
的部分。<br />

您访问神农牧APP、使用或继续使用神农牧服务、点击
“同意”本协议的按钮或其他任何方式同意和签署与神农
牧相关的用户协议（“《相关用户协议》”），即代表您
理解并同意本协议，并同意受本协议约束。若您不同意
本协议（包括神农牧此后对其不时做出的修订），应不
使用或立即停止使用神农牧提供的服务。<br />

1、定义\u2028神农牧：除另有明确约定外，指浙江农辛农业科技有限
公司及其关联方。\u2028神农牧APP：指由农辛科技运营的移动互联网应用程序,
包括但不限于，在IOS及安卓平台发布的“神农牧”。\u2028神农牧服务：指通过神农牧APP，由农辛科技提供的任
何产品、服务。\u2028法律法规：指任何适用的法律、行政法规、司法解释、
地方法规、地方规章、部门规章及其他规范性文件，包
括但不限于中国大陆的法律法规及相关服务发生地的法
律法规。<br />

2、个人信息和账户\u2028您向神农牧或通过神农牧向第三方提供的任何注册、申
请资料等信息（“个人信息”），包括但不限于姓名、证
件号码、银行账号、地址、联系方式等，应当是真实、
有效、完整和准确的。您须对上述个人信息承担全部责
任并及时维护上述信息。必要时，神农牧将向您索取有
关证件的原件、复印件、影印件等，以核实您提供信息
的真实性。一旦发现您提供的个人信息存在虚假、无效
不完整和/或不准确等情形，神农牧有权采取删除相关
信息、要求您重新提供和/或暂停提供相关服务等措施。
同时，您须谨慎保管您的用户名、密码等个人信息并定
期更换密码。通过您的用户名和密码编辑、发布的任何
信息或做出的任何行为都将被视为您本人的行为。对因
账号外借、除神农牧原因造成的账号遗失（包括但不限
于您的设备遭受他人攻击、遭受诈骗等）产生的任何损
失，神农牧不承担任何责任。您在此授权农辛科技为开
展和提供农辛科技服务，或根据任何适用的法律法规或
自律监管组织规则、《农辛科技隐私政策》等留存、使
用和 / 或向第三方提供您的个人信息。未经农辛科技同
意，您不得转让您的神农牧账户。<br />
•	隐私政策\u2028	农辛科技高度重视用户的个人信息保护，我们专门
	制定了《农辛科技隐私政策》。该隐私政策是本协
	议不可分割的一部分，请您详细阅读了解。<br />
•	服务及费用\u2028	农辛科技通过神农牧APP及其他方式，向您提供多
	样化的服务，具体内容您可以通过登录神农牧APP
	查看。<br />
•	农辛科技有权根据法律法规和业务规则
	对APP的特定内容的展示范围及服务的对象设置一
	些限制，如仅向合格投资人开放。\u2028      在法律法规允许的范围内，农辛科技有权随时设定
	调整和免除农辛科技服务的费用，并以合理合法的
	方式展示和告知用户，充分保障用户的知情权和选
	择权。您应自行承担访问神农牧APP所需的软硬件
	和网络接入费用，以及依照法律法规及《业务协
	议》应承担的其他费用。<br />
•	合法依约使用\u2028	您在使用农辛科技服务时，应严格遵守所有适用的
	法律法规及本协议。您应自行承担违反上述法律法
	规（“违法行为”）和/或本协议（“违约行为”）所
	产生的责任和损失，并赔偿农辛科技、农辛科技的
	其他用户及相关第三方因您的违法行为、违约行为
	所产生的全部实际损失。您授权农辛科技在法律法
	规允许的范围内自您在神农牧的任何账户中划扣相
	应款项以偿付农辛科技的其他用户及相关第三方的
	实际损失。农辛科技代为支付的，有权自您在农辛
	科技的任何账户中直接划扣。\u2028      鉴于互联网传播的特性，农辛科技通过其网站、
	APP等所提供的信息并非针对或意图发送给任何可
	能因提供、获取或使用这些信息而使农辛科技或用
	户违反当地法律法规的地区。您应自行甄别并在合
	法的情况下使用农辛科技服务。\u2028      建议您主动了解并遵守中华人民共和国法律法规及
	其他地区适用的法律法规对您、您所接受的服务的
	相关规定。\u2028      对于您的任何违法、违约行为，除其他救济方式外
	农辛科技有权随时根据自己的判断，视情节采取警
	示、删除相关内容、限制功能、暂停服务、冻结账
	户、（临时或永久）关闭账户等处置措施，保存记
	录并向有关主管部门报告。<br />
•	知识产权\u2028	农辛科技在其网站、APP等中使用的商标或标记均
	为农辛科技或其他特别注明的权利人所有。农辛科
	技在其网站、APP等中所包含、展示的任何文字、
	图像、视频、图表、软件及其他材料等均为农辛科
	技及其他特别注明的权利人所有，仅供您根据本协
	议个人使用，农辛科技及相应权利人并未通过本协
	议授予您对上述信息和内容的任何其他权利。除非
	经相应权利人事先书面同意，您不得以任何形式向
	任何第三方公开发表、传输、复制或以其他方式使
	用农辛科技提供的全部或部分信息，不得更改、虚
	化或删除任何署名、商标、版权标识和 / 或其他权
	利声明。您在农辛科技网站、APP等中发布的任何
	信息和内容，不得侵犯第三方的知识产权和 / 或其
	他权利。若有任何第三方对您在京东网站、APP发
	布的信息和内容提出权利主张或提起诉讼/仲裁，
	您应当自行自费解决此类纠纷，并赔偿农辛科技因
	您的侵权或涉嫌侵权行为产生的任何损失。<br />
•	风险和免责\u2028	农辛科技将尽力促使农辛科技服务的正确、持续、
	及时和安全，但在法律法规允许的最大范围内，不
	就此负担任何明示或默示的保证责任。您同意承担
	使用农辛科技服务的所有风险及因该风险可能造成
	的任何损害，农辛科技对于您所使用的各项服务或
	无法使用各项服务所导致的任何直接、间接、衍生
	或特别的损害，不负任何赔偿责任。若农辛科技服
	务因服务器、通信网络和移动终端的软硬件故障、
	计算机病毒、恶意攻击及其他不可预测的因素而受
	到影响，造成您无法通过农辛科技网站、APP访问
	和使用任何第三方提供的服务，您可尝试使用该第
	三方提供的其他渠道或尽快联系农辛科技、该第三
	方寻求帮助。农辛科技在农辛科技服务中提供的任
	何内容（包括但不限于新闻资讯、股评、投资分析
	报告、股市预测文章等）仅供参考，除明确声明外
	不构成对任何人的投资、法律、会计或税务建议，
	不保证切合您的个别情况，请您独立谨慎地判断投
	资风险。农辛科技将尽力保证所提供内容的来源可
	靠，但无法核实并不能保证上述内容的真实性、准
	确性及完整性，您不应对上述内容作不适当的依赖
	任何农辛科技转载的内容仅代表其原作者的观点和
	态度，农辛科技对此不作任何判断。在适用法律允
	许的范围内，农辛科技有权随时自行决定暂停、终
	止、修改农辛科技服务，或对部分用户暂停、终止
	修改农辛科技服务，且毋须另行通知。在适用法律
	允许的范围内，农辛科技有权随时自行决定更换提
	供服务的主体，且毋须另行通知；上述更换后的主
	体自动适用本协议，不需要您重新签署。\u2028      农辛科技可能会在农辛科技服务中集成由第三方提
	供的产品及服务、链接至第三方和 / 或展示第三方
	的标记或内容，农辛科技提供该等集成、链接、展
	示的目的仅在于向您提供方便，农辛科技对此不作
	任何保证，亦不代表农辛科技对该等第三方、其产
	品及服务的任何推荐、支持或授权，您应当自行甄
	别并自担风险。您在使用上述第三方的任何产品和
	服务时，应当了解并接受该等第三方的条款和规则<br />
 •	协议的组成和修订\u2028	就每一特定的农辛科技服务，农辛科技可能制定专
	门的业务协议、业务规则、免责声明等（合称为
	“《业务协议》”），请您在接受相关服务前仔细阅
	读；这些《业务协议》是本协议不可分割的组成部
	分，对于该特定服务而言，上述《业务协议》优先
	于并取代本协议的相关规定。农辛科技可能在其网
	站、APP等的不同页面中，规定与本协议不一致的
	条款，该等条款在其适用范围内优先于并取代本协
	议的相关规定。农辛科技有权根据其业务模式、互
	联网的发展状况、法律法规和行业监管规定变化等
	不时对本协议进行修订，并通过其认为合理的方式
	予以公布，但毋须另行通知。用户应随时关注并阅
	读最新版的协议及网站公告。神农牧账号的相关使
	用规定，适用《农辛用户注册协议》。如本协议与
	《农辛用户注册协议》有不一致之处，对于农辛科
	技服务而言，优先适用本协议。<br />
•	通知和送达\u2028	除法律法规或监管规定另有强制性规定外，本协议
	履行过程中，递给您的书面通知将按照您向农辛科
	技提供的通讯地址（包括但不限于证件地址、以本
	人作为收货人的收货地址等）交邮后的第三个自然
	日即视为送达；书面通知的形式还包括（但不限于）
	在农辛科技网站公告、向您发送电子邮件、农辛科
	技站内信、系统信息、手机短信和传真等电子方式
	在采用电子方式进行书面通知的情况下发送当日即
	视为送达。采用一种以上方式发出通知的，以最先
	送达的时间为送达时间。为维护您的合法权益，请
	您始终保持上述通讯地址和联系方式准确、有效。
	对于您与农辛科技的任何纠纷，您同意并授权司法
	机关在全部诉讼阶段和程序中按照上述方式向您送
	达任何法律文书。<br />
 •	不可抗力及第三方原因免责\u2028	因任何农辛科技不能预见、不能避免且不能克服的
	情形（“不可抗力事件”）或第三方原因造成农辛科
	技的无法提供或迟延提供服务的，在不可抗力事件
	或第三方原因影响的范围内，农辛科技不承担相关
	违约责任，包括：\u2028    （1）自然灾害、罢工、骚乱、战争、政府行为、司
	     法行政命令等不可抗力事件；\u2028    （2）电力供应故障、通讯网络故障等公共服务因素\u2028    （3）任何第三方原因。<br />
•	管辖法律和争议解决\u2028	本协议的签订、效力、履行、终止及其解释适用中
	华人民共和国法律（为本条款的目的，不包
•	括香港特别行政区、澳门特别行政区及台湾地区的
	法律）。农辛科技特别提示您，农辛科技服务中集
•	成、链接、展示的第三方产品及服务，可能适用服
	务发生地、服务提供者所在地的法律法规。因本协
	议引起的或与本协议有关的争议，您可与农辛科技
	协商解决。协商不成的，任何一方均有权向农辛科
	技所在地有管辖权的人民法院提起诉讼。<br />
•	其他约定\u2028	本协议的标题仅为阅读方便，不视为本协议的组成
	部分。若本协议的任一条款被视为无效或不可执行
	不影响本协议其余条款的有效性及可执行性。农辛
	科技有权随时对其进行修订，以在法律允许的范围
	内最大限度的实现该条款预期的法律效果。


		</div>
	</div>
</template>

<script>
	export default{
		name: 'agreement',
		data () {
			return {
			}
		},
		methods: {
			//返回
		    onClickLeft () {
		        this.$router.push({path:'/regist'})
	      	}
		}
	}
</script>

<style scoped>
.box{background: #fff;padding: .3rem .36rem;color: #555555;line-height: .36rem;}
</style>